1. Write a python program to implement List-to-Series Conversion

In [4]:
import pandas as pd
list1 = [9, 8, 7, 6, 5]
series = pd.Series(list1)
print(series)

0    9
1    8
2    7
3    6
4    5
dtype: int64

2. Write a python program to Generate the series of dates from 1st May, 2021 to 12th May, 2021 (both inclusive).

In [6]:
import pandas as pd
date = pd.date_range(start = '05-01-2021', end = '05-12-2021')
print(date)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

3. Given a dictionary, convert it into corresponding dataframe and display it.

In [8]:
import pandas as pd
dic = {'Name': ['Megha', 'Varsha', 'Anvin'],
              'Age' : [23, 25, 21],
              'Job' : ['Engineer', 'Doctor', 'Accountant']}
dataframe = pd.DataFrame(dic)
print(dataframe)

     Name  Age         Job
0   Megha   23    Engineer
1  Varsha   25      Doctor
2   Anvin   21  Accountant

4. Given a 2D List, convert it into corresponding dataframe and display it.

In [6]:
import pandas as pd
list1 = [[2, 'Megha', 23],
         [1, 'Varsha', 25],
         [1, 'Anvin', 21]]
dataframe = pd.DataFrame(list1, columns = ['Id', 'Name', 'Age'])
print(dataframe)

   Id    Name  Age
0   2   Megha   23
1   1  Varsha   25
2   1   Anvin   21

5. Given a CSV file, read it into a dataframe and display it

In [25]:
import pandas as pd
dataframe = pd.read_csv('Ex4_5.csv')
print(dataframe)

   Id    Name  Age         Job
0   1   Megha   23    Engineer
1   2  Varsha   25      Doctor
2   3   Anvin   21  Accountant

6. Given a dataframe, sort it by multiple columns

In [7]:
print(dataframe)
print()
dataframe_sorted = dataframe.sort_values(by = ['Id', 'Age']) 
print(dataframe_sorted)

   Id    Name  Age
0   2   Megha   23
1   1  Varsha   25
2   1   Anvin   21

   Id    Name  Age
2   1   Anvin   21
1   1  Varsha   25
0   2   Megha   23

7.Given a dataframe with custom indexing, convert and it to default indexing and display it.

In [8]:
print(dataframe)
print()
dataframe = dataframe.reset_index()
print(dataframe)

   Id    Name  Age
0   2   Megha   23
1   1  Varsha   25
2   1   Anvin   21

   index  Id    Name  Age
0      0   2   Megha   23
1      1   1  Varsha   25
2      2   1   Anvin   21

8.Given a dataframe, select first 2 rows and output them.

In [9]:
print(dataframe)
print()
row = dataframe.iloc[[0,1], :]
print("Data frame after extraction:")
print(row)

   index  Id    Name  Age
0      0   2   Megha   23
1      1   1  Varsha   25
2      2   1   Anvin   21

Data frame after extraction:
   index  Id    Name  Age
0      0   2   Megha   23
1      1   1  Varsha   25

9.Given is a dataframe showing name, occupation, salary of people. Find the average salary per occupation.

In [17]:
import pandas as pd
dataframe2 = pd.read_csv('Ex4_9.csv')
print(dataframe2) 
print()
print("Average salary per occupation:")
print()
avg_sal = dataframe2.groupby('Occupation')['Salary'].mean() 
print(avg_sal)

     Name  Occupation   Salary
0   Megha    Engineer  50000.0
1  Varsha      Doctor  70000.0
2   Anvin  Accountant      NaN
3  Nithin    Engineer  40000.0
4   Shijo      Doctor  80000.0

Average salary per occupation:

Occupation
Accountant        NaN
Doctor        75000.0
Engineer      45000.0
Name: Salary, dtype: float64

10.Given a dataframe with NaN Values, fill the NaN values with 0.

In [16]:
print(dataframe2) 
print()
print("After filling NaN with 0:")
print()
dataframe_nullfill = dataframe2.fillna(0)
print(dataframe_nullfill)

     Name  Occupation   Salary
0   Megha    Engineer  50000.0
1  Varsha      Doctor  70000.0
2   Anvin  Accountant      NaN
3  Nithin    Engineer  40000.0
4   Shijo      Doctor  80000.0

After filling NaN with 0:

     Name  Occupation   Salary
0   Megha    Engineer  50000.0
1  Varsha      Doctor  70000.0
2   Anvin  Accountant      0.0
3  Nithin    Engineer  40000.0
4   Shijo      Doctor  80000.0

11.Given is a dataframe showing Company Names (cname) and corresponding Profits (profit). Convert the values of Profit column such that values in it greater than 0 are set to True and the rest are set to False.

In [20]:
import pandas as pd
company = pd.read_csv('Ex4_11.csv')
print(company) 
print()
company['profit'] = company['profit'].apply(lambda x:x>0)
print(company)

  cname  profit
0   ABC   50000
1   XYZ   -5000
2   PQR   40000
3   LMN   -8000

  cname  profit
0   ABC    True
1   XYZ   False
2   PQR    True
3   LMN   False

12.Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee Name (ename) and Stipend (stipend) and the other dataframe containing Employee ID (eid) and designation of the employee (designation). Output the Dataframe containing Employee ID (eid), Employee Name (ename), Stipend (stipend) and Position (position)

In [24]:
df1 = pd.read_csv('Ex4_12a.csv')
df2 = pd.read_csv('Ex4_12b.csv')
print(df1) 
print()
print(df2) 
print()
df_out = pd.merge(df1, df2, how = 'inner', on = 'eid')
print(df_out)

   eid   ename  stipend
0  101   Megha    20000
1  102  Varsha    25000
2  103   Anvin    20000
3  104  Nithin    26000
4  105   Shijo    30000

   eid  designaion
0  101    Employee
1  102  Technician
2  103    Employee
3  104     Manager
4  105  HR Manager

   eid   ename  stipend  designaion
0  101   Megha    20000    Employee
1  102  Varsha    25000  Technician
2  103   Anvin    20000    Employee
3  104  Nithin    26000     Manager
4  105   Shijo    30000  HR Manager